Tekla Open API Reference for Tekla Structures 2025
ClipPlane.ClipPlaneID Property
 Gets the clip plane ID.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int ClipPlaneID { get; }
Public ReadOnly Property ClipPlaneID As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace